fonecmid-diplom/src/Documents/ВКМ_ГрафикиОтпусков/ВКМ_ГрафикиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикиОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышенаДлительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикиОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)	
	РассчитатьПродолжительностьОтпускаИОбновитьПодсветкуОтпусков(); 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	ОткрытьФорму("Документ.ВКМ_ГрафикиОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьПродолжительностьОтпускаИОбновитьПодсветкуОтпусков()
		
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			И ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			
			Если СтрокаОтпуска.ДатаОкончания >= СтрокаОтпуска.ДатаНачала Тогда
				СтрокаОтпуска.ПродолжительностьОтпуска = (СтрокаОтпуска.ДатаОкончания - СтрокаОтпуска.ДатаНачала)/86400 + 1;
			Иначе
				СтрокаОтпуска.ПродолжительностьОтпуска = 0;
			КонецЕсли;
			
		Иначе
			СтрокаОтпуска.ПродолжительностьОтпуска = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ПродолжительностьОтпуска");
	ТаблицаОтпусков.Свернуть("Сотрудник","ПродолжительностьОтпуска");
	
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		
		СтрокаСотрудника = ТаблицаОтпусков.Найти(СтрокаОтпуска.Сотрудник, "Сотрудник");
		Если СтрокаСотрудника = Неопределено тогда
			Продолжить;
		КонецЕсли;
		СтрокаОтпуска.ПревышенаДлительность = ?(СтрокаСотрудника.ПродолжительностьОтпуска > 28, Истина, Ложь);		
		
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()       
	
	ДанныеОтпусков = Новый Массив;

	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл

		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			
			Продолжить;
		КонецЕсли;

		ДанныеОтпуска = Новый Структура;
		ДанныеОтпуска.Вставить("Сотрудник", СтрокаОтпуска.Сотрудник.Наименование);
		ДанныеОтпуска.Вставить("ДатаНачала", СтрокаОтпуска.ДатаНачала);
		ДанныеОтпуска.Вставить("ДатаОкончания", СтрокаОтпуска.ДатаОкончания);

		ДанныеОтпусков.Добавить(ДанныеОтпуска);

	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОтпусков, Новый УникальныйИдентификатор);
КонецФункции

#КонецОбласти
